#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform

google_compute_global_address.default: Refreshing state... [id=projects/cloudresume-380001/global/addresses/resume]
google_compute_managed_ssl_certificate.default: Refreshing state... [id=projects/cloudresume-380001/global/sslCertificates/cloud-resume-cert]
google_storage_bucket.default: Refreshing state... [id=davidbour-cloud-resume]
google_firebase_project.default: Refreshing state... [id=projects/cloudresume-380001]
google_project_service.firebase_database: Refreshing state... [id=cloudresume-380001/firebasedatabase.googleapis.com]
google_compute_backend_bucket.default: Refreshing state... [id=projects/cloudresume-380001/global/backendBuckets/cloud-resume-backend-bucket]
google_storage_bucket_iam_member.default: Refreshing state... [id=b/davidbour-cloud-resume/roles/storage.objectViewer/allUsers]
google_compute_url_map.default: Refreshing state... [id=projects/cloudresume-380001/global/urlMaps/http-lb]
google_compute_target_https_proxy.default: Refreshing state... [id=projects/cloudresume-380001/global/targetHttpsProxies/cloud-https-proxy]
google_compute_global_forwarding_rule.default: Refreshing state... [id=projects/cloudresume-380001/global/forwardingRules/https-lb-forwarding-rule]
google_firebase_database_instance.default: Refreshing state... [id=projects/cloudresume-380001/locations/us-central1/instances/cloudresume-380001-default-rtdb]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_api_gateway_api.api_cfg will be created
  + resource "google_api_gateway_api" "api_cfg" {
      + api_id          = "visitor-api-gateway"
      + create_time     = (known after apply)
      + display_name    = (known after apply)
      + id              = (known after apply)
      + managed_service = (known after apply)
      + name            = (known after apply)
      + project         = (known after apply)
    }

  # google_api_gateway_api_config.api_cfg will be created
  + resource "google_api_gateway_api_config" "api_cfg" {
      + api                  = "visitor-api-gateway"
      + api_config_id        = "visitor-api-gateway-cfg"
      + api_config_id_prefix = (known after apply)
      + display_name         = (known after apply)
      + id                   = (known after apply)
      + name                 = (known after apply)
      + project              = (known after apply)
      + service_config_id    = (known after apply)

      + openapi_documents {
          + document {
              + contents = "IyBvcGVuYXBpMi1ydW4ueWFtbApzd2FnZ2VyOiAnMi4wJwppbmZvOgogIHRpdGxlOiB2aXNpdG9yLWFwaS1nYXRld2F5CiAgZGVzY3JpcHRpb246IEFQSSBHYXRld2F5IGZvciBDbG91ZCBSdW4KICB2ZXJzaW9uOiAxLjAuMApzY2hlbWVzOgogIC0gaHR0cHMKcHJvZHVjZXM6CiAgLSBhcHBsaWNhdGlvbi9qc29uCngtZ29vZ2xlLWJhY2tlbmQ6CiAgYWRkcmVzczogaHR0cHM6Ly92aXNpdG9yLWFwaS1kZW1uZmlkZzJhLXVjLmEucnVuLmFwcApwYXRoczoKICAvOgogICAgZ2V0OgogICAgICBzdW1tYXJ5OiBIb21lIFBhZ2UKICAgICAgb3BlcmF0aW9uSWQ6IG1haW4KICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEEgc3VjY2Vzc2Z1bCByZXNwb25zZQogICAgICAgICAgc2NoZW1hOgogICAgICAgICAgICB0eXBlOiBzdHJpbmcKICAvdmlzaXRvcjoKICAgIGdldDoKICAgICAgc3VtbWFyeTogR2V0IHZpc2l0b3IgY291bnQKICAgICAgb3BlcmF0aW9uSWQ6IGdldF92aXNpdG9yCiAgICAgIHJlc3BvbnNlczoKICAgICAgICAnMjAwJzoKICAgICAgICAgIGRlc2NyaXB0aW9uOiBWaXNpdG9yIGNvdW50CiAgICAgICAgICBzY2hlbWE6CiAgICAgICAgICAgIHR5cGU6IHN0cmluZwogIC92aXNpdG9yOgogICAgcG9zdDoKICAgICAgc3VtbWFyeTogSW5jcmVhc2UgdmlzaXRvciBjb3VudAogICAgICBvcGVyYXRpb25JZDogc2V0X3Zpc2l0b3IKICAgICAgcmVzcG9uc2VzOgogICAgICAgICcyMDAnOgogICAgICAgICAgZGVzY3JpcHRpb246IEluY3JlYXNlIHZpc2l0b3IgY291bnQKICAgICAgICAgIHNjaGVtYToKICAgICAgICAgICAgdHlwZTogc3RyaW5n"
              + path     = "spec.yaml"
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @david-bour, Action: `pull_request`*